export const store = {
  notifications: [
    {
      id: 1,
      title: {
        order: "Заказ 1",
        text: "оплачен и ожидает отгрузки",
      },
      message: {
        text:
          "Заказ готов к отгрузке. Мы сообщим, когда заказ будет передан на доставку. Предполагаемое время доставки",
        payDate: "21 марта",
      },
      date: "1 час назад",
    },
    {
      id: 2,
      title: {
        order: "Заказ 2",
        text: "ожидает оплаты 20 марта - 18:00",
      },
      message: {
        text:
          "Перед оплатой проверьте фактическое количество товара, оно могло измениться поставщиками.",
        payDate: null,
      },
      date: "3 часа назад",
    },
    {
      id: 3,
      title: {
        order: "Заказ 3",
        text: "успешно создан",
      },
      message: {
        text:
          "Ожидайте, пока все поставщики подтвердят готовность и уточнят количество товара.",
        payDate: null,
      },
      date: "1 день назад",
    },
    {
      id: 4,
      title: {
        order: "Заказ 4",
        text: "успешно создан",
      },
      message: {
        text:
          "Ожидайте, пока все поставщики подтвердят готовность и уточнят количество товара.",
        payDate: null,
      },
      date: "1 день назад",
    },
    {
      id: 5,
      title: {
        order: "Заказ 5",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "20 февраля",
    },
    {
      id: 6,
      title: {
        order: "Заказ 6",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "21 февраля",
    },
    {
      id: 7,
      title: {
        order: "Заказ 7",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "22 февраля",
    },
    {
      id: 8,
      title: {
        order: "Заказ 8",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "28 февраля",
    },
    {
      id: 9,
      title: {
        order: "Заказ 9",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "23 февраля",
    },
    {
      id: 10,
      title: {
        order: "Заказ 10",
        text: "успешно доставлен",
      },
      message: {
        text:
          "Товары были успешно доставлены получателю.",
        payDate: null,
      },
      date: "01 мая",
    },
    {
      id: 11,
      title: {
        order: "Заказ 11",
        text: "не был доставлен",
      },
      message: {
        text:
          "Товары исчезли.",
        payDate: null,
      },
      date: "31 мартобря",
    },
  ],
};
